{
  "intro": {
    "mainTitle": "Math en jeu",
    "subtitle": "Jeu vidéo éducatif sur les mathématiques",
    "authors": "SMAC de l'université Laval",
    "projectTitle": "eyeDesigner",
    "overview": "Project overview: A brief summary of what your project covers, and what kind of impact it had on the company.",
    "roles": [
      "Familiariser avec le jeu",
      "Création des maquettes fonctionnelles",
      "Déterminer la direction artistique",
      "Réfléchir à de nouvelles mécaniques de jeu",
      "Création des éléments visuels du jeu"
    ],
    "tools": [
      "Figma",
      "Procreate",
      "Illustrator/Photoshop",
      "Tiled",
      "Asset forge",
      "After effect",
      "Trello/ClickUp"
    ],
    "duration": "fév. 2021 - déc. 2021",
    "imageUrl": "MEJ_00_Couverture.png"
  },
  "content": {
    "mandate": {
      "title": "Mandat",
      "content": "Math en jeu est un jeu multijoueur gratuit en ligne portant sur les mathématiques qui a initialement été mis sur pied en 2005 et conçu majoritairement pour les élèves du primaire et du secondaire. Surtout utilisé dans un contexte scolaire pour permettre à toute la classe de jouer ensemble et même de faire jouer des joueurs de différents niveaux scolaires. Le but du jeu est de répondre aux plus de questions possibles pour pouvoir avancer sur le circuit et accumuler des points. Lorsque le temps est écoulé, le joueur ayant le plus de points remporte la partie. Cependant, depuis sa sortie, la technologie a beaucoup évolué et de nombreux changements étaient nécessaires pour garantir la pérennité du jeu notamment pour les interfaces et le style visuel du jeu où j'ai été amené à travailler.",
      "subtitle": "Objectifs",
      "objectives": [
        "Exposer les jeunes de tous les âges aux mathématiques par le jeu et inviter le grand public à renouer avec les mathématiques.",
        "Créer un univers concret et stimulant en évitant d'ajouter un stress supplémentaire"
      ]
    },
    "familiarization": {
      "section1": {
        "title": "Documentation",
        "content": "J'ai commencé par lire la documentation qui avait été rédigée jusqu'à maintenant et qui décrivait le fonctionnement du jeu, ses objectifs et son contexte ainsi que tout ce qui avait été fait jusqu'à présent et les prochaines étapes qui seraient à faire à court et long terme."
      },
      "section2": {
        "title": "MVP",
        "content": "Un MVP, minimum viable product, avait également été commencé ce qui m'a permis d'explorer la navigation et les fonctionnalités qui allaient être présentes. Voici notamment un schéma de type User Flow qui avait été fait avant mon arrivée.",
        "image": "/assets/images/projects/mathEnJeu/MEJ_01_MVP.png"
      }
    },
    "functionalSketch": {
      "title": "Maquettes fonctionnelles",
      "content1": "À partir de ce schéma, j'ai été en mesure d'énumérer chacun des écrans qui allaient être nécessaires et de nouveaux écrans qui devaient être ajoutés au User Flow ainsi que les informations en ordre de priorité et les fonctionnalités principales sur chacune delle. Par exemple, lorsque le joueur joue au jeu, il doit être en mesure de voir facilement et rapidement :",
      "list": [
        "Sa position sur le plateau",
        "Les items qu'il est possible de ramasser sur le plateau",
        "Ses possibilités de déplacement",
        "Son inventaire qui peut contenir quatre types d'items différents",
        "Son pointage personnel",
        "Le temps restant à la partie",
        "La position des autres joueurs",
        "Le pointage des autres joueurs"
      ],
      "content2": "J'ai ensuite créé une première version préliminaire des maquettes fonctionnelles en suivant le nouveau User Flow",
      "image": "/assets/images/projects/mathEnJeu/MEJ_02_UserFlow.png"
    },
    "artisticDirection": {
      "title": "Direction artistique",
      "section1": {
        "content1": [
          "À cette étape, l'équipe initiale de conception a été bonifiée par une équipe de consultant externe.",
          "Dans le but de créer un environnement intéressant et stimulant pour le joueur, nous avons souhaité ajouter une dimension narrative qui n’était pas présente dans la précédente version du jeu. Après plusieurs rencontres en équipe à brainstormer, réfléchir et esquisser, nous avions un grand intérêt pour l'univers Steampunk que nous avons adapté pour être plus ludiques et qui nous a servi de base pour élaborer une histoire pour donner un sens au jeu et aux personnages."
        ],
        "content2": "Robots un peu maladroits qui proviennent d'un futur lointain et qui voyage dans le temps et l'espace pour retrouver des cristaux de connaissance qui ont été perdus. Ce contexte nous a donné une ligne directrice pour ajuster certaines mécaniques de jeu et la direction artistique du jeu."
      },
      "section2": {
        "title": "Environnement",
        "content": "Le voyage dans le temps et l'espace nous a aidés pour élaborer l'environnement des plateaux de jeu qui permettrait de faire plusieurs niveaux différents et ainsi briser la redondance que les joueurs peuvent ressentir en mathématiques. Cela permettra aussi de créer de nouveau plateau de jeu une fois le jeu mis en ligne pour briser la redondance qui pourrait s'installer après la sortie. Pour la sortie du jeu, nous avons choisi de créer un plateau dans un environnement plus désertique et chaleureux."
      },
      "section3": {
        "title": "Cristaux",
        "content": "Les cristaux ont été ajoutés pour donner un sens aux points récolté par les joueurs qui vont même être utilisés pour faire changer et évoluer le décor. Plus les joueurs récoltent de cristaux en répondant correctement aux questions, plus ils amassent de « connaissances » ce qui restaure d'une certaine façon l'environnement du plateau de jeu. Cela donne également un objectif plus collaboratif de groupe tout en gardant un certain aspect de compétition entre les joueurs"
      }
    },
    "visualElementsCreation": {
      "title": "Création des éléments visuels",
      "content1": "Après avoir déterminé les grandes lignes de la direction artistique et de la narration du jeu, j'ai été placé à la création des éléments visuels qui se retrouvaient dans le jeu qui était complètement nouveau pour moi, mais qui a été un défi stimulant.",
      "content2": "Nous nous étions donc entendus sur un environnement plus désertique qui devait pouvoir évoluer au fur et à mesure que les joueurs amassaient des cristaux. J'ai donc commencé une longue phase de recherche et d'esquisse pour préciser davantage cette idée. J'ai également eu plusieurs rencontres avec l'équipe pour présenter mon avancement et discuter de certains éléments",
      "sections": [
        {
          "title": "Plateau et éléments du décor évolutif",
          "content": "Voici le processus d'exploration qui a mené à la création du plateau de jeu qui allait être de taille variable selon la durée de la partie. Nous avions aussi déterminé qu'il s'agirait d'une vue isométrique. Voici ensuite le processus pour les éléments de décor inspiré du Steampunk, mais qui respecte à la fois l'ambiance désertique du plateau. L'intégration a demandé une bonne débrouillardise pour apprendre à utiliser ce logiciel et intégrer les visuels que j'avais créés.",
          "image": "/assets/images/projects/mathEnJeu/MEJ_03_Plateau.png"
        },
        {
          "title": "Personnage du robot",
          "content": "J'ai ensuite effectué plusieurs esquisses pour créer le personnage qui a été un défi pour qu'il demeure intéressant et inclusif pour tous les joueurs.",
          "image": "/assets/images/projects/mathEnJeu/MEJ_04_Robot.png"
        },
        {
          "title": "Items",
          "content": "Étant donné que la direction artistique était très différente de la version originale du jeu, nous avons également eu à retravailler les items que le joueur pouvait ramasser dans le jeu. Par exemple, la banane qui ralentit un joueur adverse est devenue un nuage électrique qui créer un court circuit dans le robot. Voici le processus.",
          "image": "/assets/images/projects/mathEnJeu/MEJ_05_Items.png"
        },
        {
          "title": "Interfaces",
          "content": "J'ai également aidé pour l'idéation du style des interfaces pour que celui-ci demeure cohérent avec les éléments visuels précédents.",
          "image": "/assets/images/projects/mathEnJeu/MEJ_06_Intrefaces.png"
        },
        {
          "title": "Promotion",
          "content": "Une fois la création de toutes ces étapes terminées, j'ai ensuite travaillé sur le matériel promotionnel du jeu comme l'affiche du jeu et les publications sur le site web et les médias sociaux",
          "image": "/assets/images/projects/mathEnJeu/MEJ_07_Promo.png"
        }
      ]
    }
  }
}
